# 当前版本 ： python3.7.11
# 开发时间 ： 2021/9/18 10:03
"""
本节介绍常见函数的求导法则和样例解释，为神经网络相关函数的求导铺垫。

7.2.1基本函数的导数
❑ 常数函数𝑐 导数为 0，如𝑦 = 2函数的导数d𝑦/d𝑥 = 0
❑ 线性函数𝑦 = 𝑎𝑥 + 𝑐 导数为𝑎，如函数𝑦 = 2𝑥 + 1导数d𝑦/d𝑥 = 2
❑ 幂函数𝑥𝑎 导数为𝑎𝑥^(𝑎−1)，如𝑦 = 𝑥2函数d𝑦/d𝑥 = 2𝑥
❑ 指数函数𝑎^𝑥 导数为𝑎^𝑥ln 𝑎，如𝑦 = 𝑒𝑥函数d𝑦/d𝑥 = 𝑒^𝑥ln 𝑒 = 𝑒^𝑥
❑ 对数函数log𝑎 𝑥 导数为 1 / 𝑥ln 𝑎，如𝑦 = ln 𝑥函数d𝑦/d𝑥 = 1 /𝑥ln 𝑒 = 1

7.2.2常用导数性质
❑ 函数加减 (𝑓 + 𝑔)′ = 𝑓′ + 𝑔′
❑ 函数相乘 (𝑓𝑔)′ = 𝑓′ ∙ 𝑔 + 𝑓 ∙ 𝑔′
❑ 函数相除 (𝑓/𝑔)′ = 𝑓′𝑔−𝑓𝑔′/ 𝑔^2，𝑔 ≠ 0
❑ 复合函数的导数 考虑复合函数𝑓(𝑔(𝑥))，令𝑢 = 𝑔(𝑥)，其导数为：
d𝑓(𝑔(𝑥)) / d𝑥 = d𝑓(𝑢)/ d𝑢 ∙ d𝑔(𝑥) / dx = 𝑓′(𝑢) ∙ 𝑔′(𝑥)


7.2.3导数求解实战
考虑目标函数ℒ = 𝑥 ∙ 𝑤2 + 𝑏2，则其偏导数为：
                        𝜕ℒ / 𝜕𝑤 = 𝜕𝑥 ∙ 𝑤2 / 𝜕𝑤 = 𝑥 ∙ 2𝑤
                            𝜕ℒ / 𝜕𝑏 = 𝜕𝑏2 / 𝜕𝑏 = 2𝑏
考虑目标函数ℒ = 𝑥 ∙ 𝑒^𝑤 + 𝑒^𝑏，则其偏导数为：
                        𝜕ℒ / 𝜕𝑤 = 𝜕𝑥 ∙ 𝑒^𝑤 / 𝜕𝑤 = 𝑥 ∙ 𝑒^𝑤
                            𝜕ℒ / 𝜕𝑏 = 𝜕𝑒^𝑏 / 𝜕𝑏 = 𝑒^𝑏
考虑目标函数ℒ = [𝑦 − (𝑥𝑤 + 𝑏)]^2 = [(𝑥𝑤 + 𝑏) − 𝑦]^2，令𝑔 = 𝑥𝑤 + 𝑏 − 𝑦，则其偏导数为：
                        𝜕ℒ / 𝜕𝑤 = 2𝑔 ∙ 𝜕g / 𝜕𝑤 = 2𝑔 ∙ 𝑥 = 2(𝑥𝑤 + 𝑏 − 𝑦) ∙ 𝑥
                            𝜕ℒ / 𝜕𝑏 = 2𝑔 ∙ 𝜕g / 𝜕𝑏 = 2𝑔 ∙ 1 = 2(𝑥𝑤 + 𝑏 − 𝑦)
考虑目标函数ℒ = 𝑎 ln(𝑥𝑤 + 𝑏)，令𝑔 = 𝑥𝑤 + 𝑏，则其偏导数为：
                        𝜕ℒ / 𝜕𝑤 = 𝑎 ∙ 1 / 𝑔 ∙ 𝜕𝑔 / 𝜕𝑤 =𝑎 / (𝑥𝑤 + 𝑏) ∙ 𝑥
                        𝜕ℒ / 𝜕𝑏 = 𝑎 ∙ 1 / 𝑔 ∙ 𝜕𝑔 / 𝜕𝑏 = 𝑎 / (𝑥𝑤 + 𝑏)



"""